app/controllers/homes_controller.rb

SELECT `users`.* FROM `users`
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`friend_id` = 1 AND `friendships`.`status` = 'pending'
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `permissions`.* FROM `permissions` WHERE `permissions`.`user_id` = 12 AND `permissions`.`status` = 'no'
SELECT `posts`.* FROM `posts` WHERE `posts`.`posted_id` = 2
SELECT  `permissions`.* FROM `permissions` WHERE `permissions`.`post_id` = NULL LIMIT 1
SELECT `images`.* FROM `images` WHERE `images`.`imageable_id` = 2
---
	def get
		addFriends = User.all - (current_user.friends + current_user.inverse_friends) - [current_user]
		friends = current_user.friends + current_user.inverse_friends
		requests = []
		current_user.inverse_friendships.where(:status => 'pending').each do |req|
			requests << User.find(req.user_id)
		end
		permissions = Permission.where(:user_id => current_user.id,:status => "no")
		posts = []
		images = []

		friends.each do |p|
			Post.where(:posted_id => p.id).each do |o|
				if Permission.find_by(:post_id => o.id) != nil
					check = Permission.where(:post_id => o.id)
					status = true
					check.each do |c|
						if c.status == "no"
							status = false
						end
					end
					if status
						posts << o
					end
				else
					posts << o
				end
			end
			Image.where(:imageable_id => p.id).each do |o|

INSERT INTO `friendships` (`user_id`, `friend_id`, `status`, `created_at`, `updated_at`) VALUES (10, 9, 'pending', '2017-03-19 06:58:22', '2017-03-19 06:58:22')
---
	def add_friend
		Friendship.create(:user_id => current_user.id,:friend_id => params['friend_id'],:status => "pending")

SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 10 AND `friendships`.`friend_id` = 9 LIMIT 1
UPDATE `friendships` SET `status` = 'accepted', `updated_at` = '2017-03-19 06:58:58' WHERE `friendships`.`id` = 2
---
	def accept_friend
		Friendship.find_by(:user_id => params['user_id'],:friend_id => current_user.id).update(:status => "accepted")

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `privacy` = 'friends', `updated_at` = '2017-03-19 07:46:31' WHERE `users`.`id` = 9
---
	def set_privacy
		User.find(current_user.id).update(:privacy => params['privacy'])

INSERT INTO `posts` (`posted_id`, `post`) VALUES (9, '')
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'ak.manikandan5194@gmail.com' LIMIT 1
INSERT INTO `permissions` (`user_id`, `post_id`, `status`, `created_at`, `updated_at`) VALUES (1, 1, 'no', '2017-03-23 16:48:06', '2017-03-23 16:48:06')
---
	def add_post
		post = Post.create(:posted_id => current_user.id,:post => params['post'])
		params['assignedUser'].each do |user|
			if current_user.privacy == "all"
				if User.find_by(:email => user).privacy == "friends"
   					post.users << User.find_by(:email => user)
   					Permission.create(:user_id => User.find_by(:email => user).id, :post_id => post.id, :status => "no")

SELECT  `permissions`.* FROM `permissions` WHERE `permissions`.`id` = NULL LIMIT 1
UPDATE `permissions` SET `status` = 'yes', `updated_at` = '2017-03-23 16:06:07' WHERE `permissions`.`id` = 1
---
	def approve
		Permission.find(params['permission_id']).update(:status => "yes")