app/controllers/images_controller.rb

INSERT INTO `images` (`created_at`, `updated_at`, `avatar`, `imageable_type`, `imageable_id`, `owner_id`) VALUES ('2017-03-19 07:05:23', '2017-03-19 07:05:23', 'E-museums.jpg', 'User', 9, 9)
---
	def create
		image = current_user.images.create(:avatar => params['image']['avatar'],:owner_id => current_user.id)