app/controllers/registrations_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'ak.manikandan5194@gmail.com'
---
  def create
      if User.where(:email => params['user']['email']).present?